# Sorting Series and Data Frames

### Paulo C. Rios Jr. | Oct 24, 2017

In [1]:
import pandas as pd

In [20]:
sales_shoes = pd.Series([230, 568, 985, 203], 
                        index = ["Q1", "Q2", "Q3", "Q4"] )

In [21]:
sales_shoes

Q1    230
Q2    568
Q3    985
Q4    203
dtype: int64

In [22]:
sales_shoes.sort_values()

Q4    203
Q1    230
Q2    568
Q3    985
dtype: int64

In [23]:
sales_shoes.sort_values(ascending = False)

Q3    985
Q2    568
Q1    230
Q4    203
dtype: int64

In [2]:
sales = pd.DataFrame({"Shoes": [230, 568, 985],
                     "Clothing": [1716, 1412, 2387],
                     "Music": [12899, 7187, 19256],
                     "Books": [5549, 2318, 1426],
                     "Stores": ["Las Vegas", 
                                "Orlando", 
                                "Los Angeles"]})

In [3]:
sales

   Books  Clothing  Music  Shoes       Stores
0   5549      1716  12899    230    Las Vegas
1   2318      1412   7187    568      Orlando
2   1426      2387  19256    985  Los Angeles

In [4]:
sales.set_index("Stores", inplace = True)

In [5]:
sales

             Books  Clothing  Music  Shoes
Stores
Las Vegas     5549      1716  12899    230
Orlando       2318      1412   7187    568
Los Angeles   1426      2387  19256    985

In [11]:
sales.sort_values(["Books"], ascending = False)

             Books  Clothing  Music  Shoes
Stores
Las Vegas     5549      1716  12899    230
Orlando       2318      1412   7187    568
Los Angeles   1426      2387  19256    985

In [24]:
sales.sort_values(["Books", "Music"], ascending = [1,1])

             Books  Clothing  Music  Shoes
Stores
Los Angeles   1426      2387  19256    985
Orlando       2318      1412   7187    568
Las Vegas     5549      1716  12899    230